Revit 2016 API
MacroModule.GetEnumerator Method
Returns an enumerator that iterates through the Macros.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public virtual IEnumerator<Macro> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of Macro)
Visual C++
public:
virtual IEnumerator<Macro^>^ GetEnumerator()
Return Value
An IEnumerator(Macro) object that can be used to iterate through key-value pairs in the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace